{
  "TITLE": "Portfolio",
  "VIEW_DETAILS": "Voir les détails",
  "LOAD_MORE": "Charger plus",
  "NO_PROJECTS": "Aucun projet trouvé dans cette catégorie",
  "ABOUT": "À propos",
  "DATE": "Date",
  "TECHNOLOGIES": "Technologies",
  "CATEGORY": "Catégorie",
  "VIEW_CODE": "Voir le code",
  "VIEW_LIVE": "Voir en ligne",
  
  "CATEGORIES": {
    "ALL": "Tous",
    "WEB": "Web",
    "MOBILE": "Mobile",
    "BACKEND": "Backend / APIs",
    "DESKTOP": "Application de bureau",
    "GAME_DEV": "Jeux"
  },

  "PROJECTS": {
    "PROJECT1": {
      "TITLE": "Point de Vente",
      "DESCRIPTION": "Système de point de vente complet pour un restaurant.",
      "DATE": "Novembre 2023",
      "DETAILS": "Application de point de vente développée avec Java et JavaFX pour le frontend, et un stockage de données en JSON local. Fonctionnalités incluent la gestion des commandes, le traitement des paiements, la génération de rapports de ventes."
    },
    "PROJECT2": {
      "TITLE": "Portfolio",
      "DESCRIPTION": "Site web personnel pour présenter des projets et compétences.",
      "DATE": "Novembre 2025",
      "DETAILS": "Site web développé avec Angular et Node.js. Design responsive, animations fluides, intégration de formulaires de contact, galerie de projets."
    },
    "PROJECT3": {
      "TITLE": "Générateur de Mots de Passe",
      "DESCRIPTION": "Application de bureau pour générer des mots de passe sécurisés.",
      "DATE": "Mars 2024",
      "DETAILS": "Application de bureau développée avec Python et Tkinter. Génération de mots de passe personnalisables, options pour inclure des majuscules, minuscules, chiffres et symboles, et fonctionnalité de copie dans le presse-papiers."
    },
    "PROJECT4": {
      "TITLE": "IBSI Hotel",
      "DESCRIPTION": "Site web d'un hôtel fictif pour un projet scolaire.",
      "DATE": "Mai 2022",
      "DETAILS": "Site web développé avec PHP, Ajax, jQuery et JavaScript. Présentation des chambres, services, galerie d'images, formulaire de réservation."
    },
    "PROJECT5": {
      "TITLE": "Waymate Frontend",
      "DESCRIPTION": "Frontend pour une application de planification de voyages en covoiturage.",
      "DATE": "Décembre 2023",
      "DETAILS": "Site web développé avec Angular, TypeScript, SQL Server et Bootstrap. Interface utilisateur intuitive, gestion des trajets, intégration de cartes et système de réservation."
    }
  }
}
